# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install Binaries
brew 'awsebcli'
brew 'git'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'wget'

# Development
brew 'node'
brew 'python'
brew 'ctags'
brew 'autoenv'
brew 'vim'
brew 'mysql'
brew 'docker'
brew 'heroku-toolbelt'
# brew services start mysql

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'sequel-pro'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'evernote'
cask 'polymail'
cask 'sourcetree'
cask 'spectacle'
cask 'visual-studio-code'
cask 'kindle'
cask 'karabiner-elements'
cask 'atom'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Giphy Capture', id: 668208984
mas 'Line', id: 539883307
